source/sgkprovizyon/TestXml/KpsSorgulama/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:kps="http://kps.mobile.sgk.gov.tr">
   <soapenv:Header/>
   <soapenv:Body>
      <kps:kisiSorgula>
         <tcKimlikNo>18184565918</tcKimlikNo>
         <ciltNo>140</ciltNo>
         <ilKodu>10</ilKodu>
         <dogumYili>1990</dogumYili>
         <uyruk>1</uyruk>
         <ikametTezkereNo xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         <uygKod>10</uygKod>
      </kps:kisiSorgula>
   </soapenv:Body>
</soapenv:Envelope>